Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_cloud.c
/* SPDX-License-Identifier: Apache-2.0 */
#include "bk7258_agent_cloud.h"
#include "bk7258_cloud_audio.h"
#include "bk7258_voice_config.h"
#include "bk7258_voice_tls.h"
#include "bk7258_preferences.h"
#include "voice/voice_asr.h"
#include "voice/voice_tts.h"
#include "agent_config.h"
#include "infra/config_store.h"
#include "llm/llm_proxy.h"

#include <errno.h>
#include <netdb.h>
#include <netinet/in.h>
#include <pthread.h>
#include <stdatomic.h>
#include <stdlib.h>
#include <string.h>
#include <syslog.h>
#include <time.h>
#include <mbedtls/platform_util.h>

/* Immutable selected trust/config with a locked TLS session cache.
 * Reference counts include the configuration owner and each active backend.
 * Active TLS contexts and sockets are never shared between backends. */
struct cloud_settings_s
{
  struct bkvoice_config_s trust;
  struct bkcloud_config_s service;
  /* The configuration snapshot caches the TLS session only, never audio,
   * answers or a live socket.
   */
  mbedtls_ssl_session session;
  mbedtls_x509_time valid_from;
  mbedtls_x509_time valid_to;
  bool session_valid;
  unsigned int references;
};

struct cloud_backend_s
{
  struct cloud_settings_s *settings;
  struct bkcloud_config_s service;
  struct bkvoice_tls_s tls;
  mbedtls_x509_time session_from;
  mbedtls_x509_time session_to;
  bool session_offered;
  atomic_bool canceled;
};

static pthread_mutex_t g_config_lock = PTHREAD_MUTEX_INITIALIZER;
static struct cloud_settings_s *g_selected;
static struct cloud_backend_s g_asr;
static struct cloud_backend_s g_tts;
static struct cloud_backend_s g_llm;
static atomic_int g_thinking = ATOMIC_VAR_INIT(-1);

/* Correlation only: one increasing identifier per recognized utterance.  The
 * following language-model and speech-synthesis requests of that turn carry
 * the same value so the receive, queue and playback splits can be aligned
 * without logging text, audio or credentials.
 */
static atomic_uint g_turn_sequence = ATOMIC_VAR_INIT(0u);

static uint64_t tts_now_ms(void)
{
  return bkvoice_config_now_ms(NULL);
}

void bkagent_cloud_set_thinking(bool enabled)
{
  atomic_store(&g_thinking, enabled ? 1 : 0);
}

int bkagent_cloud_get_thinking(bool *enabled)
{
  if (!enabled) return -EINVAL;
  pthread_mutex_lock(&g_config_lock);
  int ret = !g_selected ? -EAGAIN :
            g_selected->service.dialect == 2 ? 0 : -ENOTSUP;
  pthread_mutex_unlock(&g_config_lock);
  int mode = atomic_load(&g_thinking);
  if (!ret && mode < 0) ret = -EAGAIN;
  if (!ret) *enabled = mode != 0;
  return ret;
}

static void settings_release(struct cloud_settings_s *settings)
{
  if (!settings) return;
  pthread_mutex_lock(&g_config_lock);
  bool last = --settings->references == 0;
  pthread_mutex_unlock(&g_config_lock);
  if (last)
    {
      mbedtls_ssl_session_free(&settings->session);
      bkvoice_config_clear(&settings->trust);
      bkcloud_config_clear(&settings->service);
      mbedtls_platform_zeroize(settings, sizeof(*settings));
      free(settings);
    }
}

static int certificate_time_compare(const mbedtls_x509_time *a,
                                     const mbedtls_x509_time *b)
{
  const int left[] = { a->year, a->mon, a->day, a->hour, a->min, a->sec };
  const int right[] = { b->year, b->mon, b->day, b->hour, b->min, b->sec };
  for (unsigned int i = 0; i < sizeof(left) / sizeof(left[0]); i++)
    if (left[i] != right[i]) return left[i] < right[i] ? -1 : 1;
  return 0;
}

static void certificate_time_limit(const mbedtls_x509_crt *chain,
                                    mbedtls_x509_time *from,
                                    mbedtls_x509_time *to)
{
  for (; chain; chain = chain->next)
    {
      if (!chain->raw.len) continue;
      if (certificate_time_compare(from, &chain->valid_from) < 0)
        *from = chain->valid_from;
      if (certificate_time_compare(to, &chain->valid_to) > 0)
        *to = chain->valid_to;
    }
}

static int session_load(void *context, mbedtls_ssl_context *ssl,
                         const char *host, uint16_t port)
{
  struct cloud_backend_s *backend = context;
  struct cloud_settings_s *settings = backend->settings;
  backend->session_offered = false;
  if (strcmp(host, settings->service.host) || port != settings->service.port)
    return -EPERM;
  pthread_mutex_lock(&g_config_lock);
  if (settings->session_valid &&
      (mbedtls_x509_time_is_future(&settings->valid_from) ||
       mbedtls_x509_time_is_past(&settings->valid_to)))
    {
      /* A resumed handshake does not resend the certificate chain, so an
       * expired authentication result must not be reused.
       */
      settings->session_valid = false;
      mbedtls_ssl_session_free(&settings->session);
      mbedtls_ssl_session_init(&settings->session);
    }
  bool offered = settings->session_valid;
  int ret = offered ? mbedtls_ssl_set_session(ssl, &settings->session) : 0;
  if (offered && ret == 0)
    {
      /* Each connection keeps its own time bounds and is unaffected by
       * another backend updating the shared cache.
       */
      backend->session_from = settings->valid_from;
      backend->session_to = settings->valid_to;
      backend->session_offered = true;
    }
  pthread_mutex_unlock(&g_config_lock);
  syslog(LOG_INFO, "AGENT TLS session offered=%d result=%d\n", offered, ret);
  return ret == 0 ? 0 :
         ret == MBEDTLS_ERR_SSL_ALLOC_FAILED ? -ENOMEM : -EKEYREJECTED;
}

static int session_save(void *context, const mbedtls_ssl_context *ssl,
                         const char *host, uint16_t port)
{
  struct cloud_backend_s *backend = context;
  struct cloud_settings_s *settings = backend->settings;
  const mbedtls_x509_crt *peer = mbedtls_ssl_get_peer_cert(ssl);
  if (!peer || strcmp(host, settings->service.host) ||
      port != settings->service.port) return -EKEYREJECTED;
  if (backend->session_offered &&
      (mbedtls_x509_time_is_future(&backend->session_from) ||
       mbedtls_x509_time_is_past(&backend->session_to)))
    return -EKEYREJECTED;
  mbedtls_x509_time from = peer->valid_from;
  mbedtls_x509_time to = peer->valid_to;
  certificate_time_limit(peer, &from, &to);
  certificate_time_limit(&settings->trust.ca, &from, &to);
  if (backend->session_offered)
    {
      /* The resumed session copied by mbedTLS keeps the leaf certificate
       * only, so the time bounds of the original full chain are retained.
       * The trust configuration is immutable inside that snapshot; a
       * configuration replacement creates an empty cache and frees the old
       * one.
       */
      if (certificate_time_compare(&from, &backend->session_from) < 0)
        from = backend->session_from;
      if (certificate_time_compare(&to, &backend->session_to) > 0)
        to = backend->session_to;
    }
  /* The CA bundle may contain rotating roots that did not take part in this
   * verification; when the conservative intersection is unusable, only the
   * cache is disabled. It neither overrides the full verification mbedTLS
   * already completed nor caches a wider authentication window.
   */
  bool reusable = !mbedtls_x509_time_is_future(&from) &&
                  !mbedtls_x509_time_is_past(&to);
  pthread_mutex_lock(&g_config_lock);
  mbedtls_ssl_session_free(&settings->session);
  mbedtls_ssl_session_init(&settings->session);
  settings->session_valid = reusable &&
                            mbedtls_ssl_get_session(ssl, &settings->session) == 0;
  settings->valid_from = from;
  settings->valid_to = to;
  pthread_mutex_unlock(&g_config_lock);
  return 0;
}

static void backend_release(struct cloud_backend_s *backend)
{
  if (!backend->settings) return;
  /* The official registry prevents deinit while a request/cancel uses TLS. */
  (void)bkvoice_tls_ops()->close(&backend->tls);
  (void)bkvoice_tls_uninitialize(&backend->tls);
  settings_release(backend->settings);
  backend->settings = NULL;
  bkcloud_config_clear(&backend->service);
}

static int tts_selection(struct bkcloud_config_s *service)
{
  char value[128] = { 0 };
  if (claw_config_get(AGENT_CFG_KEY_TTS_LOCATION, value, sizeof(value)) == 0 &&
      value[0] && strcmp(value, "remote")) return -EINVAL;
  if (claw_config_get(AGENT_CFG_KEY_TTS_BACKEND, value, sizeof(value)) == 0 &&
      value[0] && strcmp(value, service->dialect == 2 ? "mimo" : "openai-audio"))
    return -EINVAL;
  if (claw_config_get(AGENT_CFG_KEY_TTS_VOICE, value, sizeof(value)) == 0 && value[0])
    {
      /* Only the existing authorized default voices have been evaluated.
       * Never send an unrecognized private/local voice identifier remotely. */
      if (strcmp(value, service->dialect == 2 ? "mimo_default" : "alloy"))
        return -ENOTSUP;
      memcpy(service->tts_voice, value, sizeof(value));
    }
  return 0;
}

static int backend_prepare(struct cloud_backend_s *backend, uint8_t dialect)
{
  pthread_mutex_lock(&g_config_lock);
  struct cloud_settings_s *settings = g_selected;
  if (settings && settings->service.dialect == dialect)
    settings->references++;
  else
    settings = NULL;
  pthread_mutex_unlock(&g_config_lock);
  if (!settings) return -ENOKEY;
  backend->service = settings->service;
  int ret = backend == &g_tts ? tts_selection(&backend->service) : 0;
  if (ret != 0)
    {
      bkcloud_config_clear(&backend->service);
      settings_release(settings);
      return ret;
    }
  struct bkvoice_tls_config_s tls =
    {
      .peer_address = settings->trust.peer_address,
      .server_ca = &settings->trust.ca,
      .server_auth_only = true,
      .trusted_time = bkvoice_config_trusted_time,
      .now_ms = bkvoice_config_now_ms,
      .clock_context = &settings->trust,
      .session_load = session_load,
      .session_save = session_save,
      .session_context = backend,
    };
  ret = bkvoice_tls_initialize(&backend->tls, &tls);
  if (ret != 0)
    {
      bkcloud_config_clear(&backend->service);
      settings_release(settings);
    }
  else backend->settings = settings;
  return ret;
}

static int request_prepare(struct cloud_backend_s *backend)
{
  if (!backend->settings) return -ENOKEY;
  atomic_store(&backend->canceled, false);
  return bkvoice_config_trusted_time(&backend->settings->trust);
}

