Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_cloud.c
static int request_cancel(struct cloud_backend_s *backend)
{
  atomic_store(&backend->canceled, true);
  return bkvoice_tls_ops()->interrupt(&backend->tls);
}

/* Preserve cancellation even across the transport's new-connection reset.
 * Connection and all I/O remain bounded by the original request deadline. */
static int cloud_open(void *context, const char *host, uint16_t port,
                      uint64_t deadline)
{
  struct cloud_backend_s *backend = context;
  if (atomic_load(&backend->canceled)) return -ECANCELED;
  struct addrinfo hints = { .ai_family = AF_INET, .ai_socktype = SOCK_STREAM };
  struct addrinfo *addresses = NULL;
  int resolved = getaddrinfo(host, NULL, &hints, &addresses);
  if (resolved != 0 || !addresses) return -EHOSTUNREACH;
  backend->tls.config.peer_address =
    ((struct sockaddr_in *)addresses->ai_addr)->sin_addr;
  freeaddrinfo(addresses);
  if (atomic_load(&backend->canceled)) return -ECANCELED;
  int ret = bkvoice_tls_ops()->open_verified(&backend->tls, host, port, deadline);
  if (atomic_load(&backend->canceled))
    {
      (void)bkvoice_tls_ops()->close(&backend->tls);
      return -ECANCELED;
    }
  return ret;
}

static ssize_t cloud_send(void *context, const uint8_t *data, size_t size,
                          uint64_t deadline)
{
  struct cloud_backend_s *backend = context;
  if (atomic_load(&backend->canceled)) return -ECANCELED;
  return bkvoice_tls_ops()->send(&backend->tls, data, size, deadline);
}

static ssize_t cloud_recv(void *context, uint8_t *data, size_t size,
                          uint64_t deadline)
{
  struct cloud_backend_s *backend = context;
  if (atomic_load(&backend->canceled)) return -ECANCELED;
  return bkvoice_tls_ops()->recv(&backend->tls, data, size, deadline);
}

static int cloud_close(void *context)
{
  return bkvoice_tls_ops()->close(&((struct cloud_backend_s *)context)->tls);
}

static const struct bkvoice_wss_tls_ops_s g_transport =
{
  .open_verified = cloud_open,
  .send = cloud_send,
  .recv = cloud_recv,
  .close = cloud_close,
};

static int asr_mimo_prepare(void) { return backend_prepare(&g_asr, 2); }
static int asr_audio_prepare(void) { return backend_prepare(&g_asr, 1); }
static int tts_mimo_prepare(void) { return backend_prepare(&g_tts, 2); }
static int tts_audio_prepare(void) { return backend_prepare(&g_tts, 1); }

struct llm_body_s { const char *data; size_t size; size_t offset; };

static int llm_body(void *buffer, size_t *size, const void **data,
                    size_t requested, void *context)
{
  struct llm_body_s *body = context;
  (void)buffer;
  size_t count = body->size - body->offset;
  if (count > requested) count = requested;
  *data = body->data + body->offset;
  *size = count;
  body->offset += count;
  return 0;
}

static int llm_transport(const char *request, char *response, size_t capacity,
                         size_t *length, int *status, void *context,
                         int (*check)(void *), void *request_context)
{
  struct cloud_backend_s *backend = context;
  struct bkcloud_http_s *http = calloc(1, sizeof(*http));
  if (!http) return -ENOMEM;
  uint64_t started_ms = tts_now_ms();
  struct llm_body_s body = { .data = request, .size = strlen(request) };
  char *adapted = NULL;
  *length = 0;
  *status = 0;
  int ret = request_prepare(backend);
  if (!ret && check) ret = check(request_context);

  /* MiMo enables deep thinking by default. The product's restored/confirmed
   * device setting is used; the service default is kept while the
   * configuration is not ready, and an explicit thinking choice from the
   * official caller is preserved. Only the selected service's protocol
   * parameter is added here; model, messages, tools and session ownership are
   * untouched.
   */
  int thinking_mode = atomic_load(&g_thinking);
  if (!ret && backend->service.dialect == 2 && thinking_mode >= 0)
    {
      cJSON *root = cJSON_Parse(request);
      if (!cJSON_IsObject(root)) ret = -EPROTO;
      else if (!cJSON_GetObjectItemCaseSensitive(root, "thinking"))
        {
          cJSON *thinking = cJSON_AddObjectToObject(root, "thinking");
          const char *type = thinking_mode ? "enabled" : "disabled";
          if (!thinking || !cJSON_AddStringToObject(thinking, "type", type))
            ret = -ENOMEM;
          else
            {
              adapted = cJSON_PrintUnformatted(root);
              if (!adapted) ret = -ENOMEM;
              else
                {
                  body.data = adapted;
                  body.size = strlen(adapted);
                  syslog(LOG_INFO,
                    "AGENT LLM MiMo thinking=%s source=device-setting\n", type);
                }
            }
        }
      cJSON_Delete(root);
    }

  if (!ret) ret = bkcloud_http_post(http, &backend->service, "chat/completions",
    &g_transport, backend, bkvoice_config_now_ms(NULL) + 60000u,
    llm_body, &body, body.size, response, capacity);
  if (atomic_load(&backend->canceled)) ret = -ECANCELED;
  *status = http->status;
  if (!ret) *length = http->received;
  if (adapted)
    {
      mbedtls_platform_zeroize(adapted, body.size + 1);
      cJSON_free(adapted);
    }
  mbedtls_platform_zeroize(http, sizeof(*http));
  free(http);
  syslog(LOG_INFO, "AGENT LLM transport=verified-cloud status=%d ret=%d "
         "bytes=%zu turn=%u ms=%llu\n",
         *status, ret, *length, atomic_load(&g_turn_sequence),
         (unsigned long long)(tts_now_ms() - started_ms));
  return ret;
}

static int llm_cancel(void *context) { return request_cancel(context); }

int bkagent_cloud_activate_llm(void)
{
  if (llm_request_busy()) return -EBUSY;
  int ret = llm_clear_transport();
  if (ret) return ret;
  backend_release(&g_llm);
  pthread_mutex_lock(&g_config_lock);
  uint8_t dialect = g_selected ? g_selected->service.dialect : 0;
  pthread_mutex_unlock(&g_config_lock);
  ret = backend_prepare(&g_llm, dialect);
  if (!ret) ret = llm_set_transport(g_llm.service.chat_model, g_llm.service.host,
                                   llm_transport, llm_cancel, &g_llm);
  if (ret) backend_release(&g_llm);
  return ret;
}

int bkagent_cloud_clear(void)
{
  if (voice_asr_is_busy() || voice_tts_is_busy() || llm_request_busy())
    return -EBUSY;
  int ret = llm_clear_transport();
  if (ret) return ret;
  backend_release(&g_llm);
  backend_release(&g_tts);
  backend_release(&g_asr);
  pthread_mutex_lock(&g_config_lock);
  struct cloud_settings_s *settings = g_selected;
  g_selected = NULL;
  pthread_mutex_unlock(&g_config_lock);
  settings_release(settings);
  return 0;
}

int bkagent_cloud_verify_service(void)
{
  struct cloud_backend_s *backend = &g_llm;
  int ret = request_prepare(backend);
  if (!ret) ret = cloud_open(backend, backend->service.host,
                             backend->service.port,
                             bkvoice_config_now_ms(NULL) + 15000u);
  int closed = cloud_close(backend);
  if (!ret) ret = closed;
  syslog(LOG_INFO, "AGENT service TLS verified=%d result=%d\n", ret == 0, ret);
  return ret;
}
static int asr_request_prepare(void) { return request_prepare(&g_asr); }
static int tts_request_prepare(void) { return request_prepare(&g_tts); }
static int asr_cancel(void) { return request_cancel(&g_asr); }
static int tts_cancel(void) { return request_cancel(&g_tts); }
static void asr_release(void) { backend_release(&g_asr); }
static void tts_release(void) { backend_release(&g_tts); }

