Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_cloud.c
static int recognize(const unsigned char *pcm, size_t size,
                     char *text, size_t capacity)
{
  struct bkcloud_client_s *client = calloc(1, sizeof(*client));
  unsigned int turn =
    atomic_fetch_add(&g_turn_sequence, 1u) + 1u;
  uint64_t started_ms = tts_now_ms();
  if (!client) return -ENOMEM;
  int ret = bkcloud_recognize(client, &g_asr.service,
    &g_transport, &g_asr, bkvoice_config_now_ms(NULL) + 60000u,
    pcm, size, text, capacity);
  if (atomic_load(&g_asr.canceled)) ret = -ECANCELED;
  if (ret != 0 && capacity) text[0] = '\0';
  mbedtls_platform_zeroize(client, sizeof(*client));
  free(client);
  /* "turn" starts the correlated timeline of one spoken request; "ms" is the
   * complete batch recognition, not a partial result. */
  syslog(LOG_INFO, "AGENT ASR backend=%s mode=batch ret=%d turn=%u "
    "input_bytes=%zu ms=%llu\n",
    g_asr.settings->service.dialect == 2 ? "mimo" : "openai-audio", ret,
    turn, size, (unsigned long long)(tts_now_ms() - started_ms));
  return ret;
}

/* Bounded hand-off between the provider's TLS receive path and the official
 * Voice/Media playback callback.
 *
 * The streaming callback used to run directly inside the HTTP sink, so a
 * blocking Media write stalled TLS reads and any arrival jitter larger than
 * the small hardware buffer became an audible gap.  Keep one bounded,
 * cancellable queue here, owned by this adapter; the official Agent keeps
 * ownership of the player, of the PCM format and of the terminal callback.
 *
 * The producer only waits for queue space, never for the audio device, and
 * the consumer waits for PCM or for the end marker.  Both waits are bounded
 * so a dead player cannot hang a voice turn forever.
 */
#define BKCLOUD_TTS_QUEUE_CAPACITY  (96u * 1024u)
#define BKCLOUD_TTS_QUEUE_PREBUFFER (8000u)
#define BKCLOUD_TTS_QUEUE_PRIME_MS  150u
#define BKCLOUD_TTS_QUEUE_CHUNK     (4096u)
#define BKCLOUD_TTS_QUEUE_GAP_MS    150u
#define BKCLOUD_TTS_QUEUE_STALL_MS  15000u

struct tts_queue_s
{
  pthread_mutex_t lock;
  pthread_cond_t ready;
  pthread_cond_t space;
  pthread_t worker;
  unsigned char *ring;
  size_t capacity;
  size_t head;
  size_t tail;
  size_t used;
  size_t peak;
  bool eof;
  bool abort;
  bool running;
  int error;
  uint64_t first_input_ms;
  uint64_t last_input_ms;
  uint64_t max_gap_ms;
  size_t gap_events;
  uint64_t producer_wait_ms;
  uint64_t first_output_ms;
  uint64_t dry_wait_ms;
  size_t dry_events;
  voice_tts_chunk_cb callback;
  void *context;
};

struct pcm_output_s
{
  voice_tts_chunk_cb callback;
  void *context;
  struct tts_queue_s *queue;
  unsigned char *buffer;
  size_t capacity;
  size_t used;
  unsigned char tail;
  bool has_tail;
  int16_t pending[3];
  uint8_t pending_count;
};

static struct tts_queue_s *tts_queue_create(void)
{
  struct tts_queue_s *queue = calloc(1, sizeof(*queue));
  if (queue == NULL) return NULL;
  queue->capacity = BKCLOUD_TTS_QUEUE_CAPACITY;
  queue->ring = malloc(queue->capacity);
  if (queue->ring == NULL ||
      pthread_mutex_init(&queue->lock, NULL) != 0 ||
      pthread_cond_init(&queue->ready, NULL) != 0 ||
      pthread_cond_init(&queue->space, NULL) != 0)
    {
      free(queue->ring);
      free(queue);
      return NULL;
    }
  return queue;
}

static void tts_queue_destroy(struct tts_queue_s *queue)
{
  if (queue == NULL) return;
  pthread_mutex_destroy(&queue->lock);
  pthread_cond_destroy(&queue->ready);
  pthread_cond_destroy(&queue->space);
  if (queue->ring != NULL) free(queue->ring);
  free(queue);
}

static bool tts_absolute_deadline(unsigned int timeout_ms,
                                  struct timespec *deadline)
{
  if (clock_gettime(CLOCK_REALTIME, deadline) < 0) return false;
  deadline->tv_sec += timeout_ms / 1000u;
  deadline->tv_nsec += (long)(timeout_ms % 1000u) * 1000000L;
  if (deadline->tv_nsec >= 1000000000L)
    {
      deadline->tv_sec++;
      deadline->tv_nsec -= 1000000000L;
    }
  return true;
}

/* Producer side: the TLS receive path only hands PCM over. */
static int tts_queue_write(struct tts_queue_s *queue, const void *data,
                           size_t size)
{
  const unsigned char *bytes = data;
  size_t offset = 0;
  int ret = 0;
  if (size == 0) return 0;

  pthread_mutex_lock(&queue->lock);
  uint64_t now = tts_now_ms();
  if (queue->last_input_ms && now > queue->last_input_ms)
    {
      uint64_t gap = now - queue->last_input_ms;
      if (gap > queue->max_gap_ms) queue->max_gap_ms = gap;
      if (gap >= BKCLOUD_TTS_QUEUE_GAP_MS) queue->gap_events++;
    }
  queue->last_input_ms = now;
  if (!queue->first_input_ms) queue->first_input_ms = now;

  while (offset < size)
    {
      if (queue->abort) { ret = -ECANCELED; break; }
      if (queue->error < 0) { ret = queue->error; break; }
      size_t available = queue->capacity - queue->used;
      if (available == 0)
        {
          /* Bounded backpressure.  The audio device is the slow side here,
           * which is normal; only a permanently blocked consumer is fatal.
           */
          struct timespec deadline;
          uint64_t started = tts_now_ms();
          if (!tts_absolute_deadline(BKCLOUD_TTS_QUEUE_STALL_MS, &deadline))
            { ret = -EIO; break; }
          while (!queue->abort && queue->error >= 0 &&
                 queue->used == queue->capacity)
            {
              if (pthread_cond_timedwait(&queue->space, &queue->lock,
                                         &deadline) == ETIMEDOUT &&
                  queue->used == queue->capacity)
                {
                  queue->error = -ETIMEDOUT;
                  break;
                }
            }
          queue->producer_wait_ms += tts_now_ms() - started;
          continue;
        }
      size_t chunk = size - offset;
      if (chunk > available) chunk = available;
      size_t contiguous = queue->capacity - queue->tail;
      if (chunk > contiguous) chunk = contiguous;
      memcpy(queue->ring + queue->tail, bytes + offset, chunk);
      queue->tail = (queue->tail + chunk) % queue->capacity;
      queue->used += chunk;
      offset += chunk;
      if (queue->used > queue->peak) queue->peak = queue->used;
      pthread_cond_signal(&queue->ready);
    }
  pthread_mutex_unlock(&queue->lock);
  return ret;
}

static void tts_queue_mark_eof(struct tts_queue_s *queue, bool success)
{
  pthread_mutex_lock(&queue->lock);
  queue->eof = true;
  if (!success) queue->abort = true;
  pthread_cond_broadcast(&queue->ready);
  pthread_cond_broadcast(&queue->space);
  pthread_mutex_unlock(&queue->lock);
}

static void tts_queue_cancel(struct tts_queue_s *queue)
{
  pthread_mutex_lock(&queue->lock);
  queue->abort = true;
  pthread_cond_broadcast(&queue->ready);
  pthread_cond_broadcast(&queue->space);
  pthread_mutex_unlock(&queue->lock);
}

/* Consumer side: drains the queue at the audio device's pace and keeps the
 * official callback contract, including the single terminal callback. */
static void *tts_queue_worker(void *argument)
{
  struct tts_queue_s *queue = argument;
  unsigned char chunk[BKCLOUD_TTS_QUEUE_CHUNK];
  bool first = true;
  bool delivered = false;

  for (;;)
    {
      /* Only the start is gated by the pre-buffer; afterwards the queue is
       * drained as fast as the audio device accepts it, so a steady provider
       * is never throttled by the queue itself.
       */
      size_t gate = first ? BKCLOUD_TTS_QUEUE_PREBUFFER : 1u;
      pthread_mutex_lock(&queue->lock);
      while (!queue->abort && queue->used < gate && !queue->eof)
        {
          uint64_t started = tts_now_ms();
          int waited;
          if (first && queue->used > 0)
            {
              /* A provider that cannot deliver the whole pre-buffer within
               * the priming window is already slower than the audio device;
               * start with what arrived instead of adding start-up delay to
               * a stream that no amount of buffering would fix.
               */
              struct timespec deadline;
              if (!tts_absolute_deadline(BKCLOUD_TTS_QUEUE_PRIME_MS, &deadline))
                {
                  pthread_mutex_unlock(&queue->lock);
                  tts_queue_cancel(queue);
                  goto done;
                }
              waited = pthread_cond_timedwait(&queue->ready, &queue->lock,
                                              &deadline);
            }
          else
            waited = pthread_cond_wait(&queue->ready, &queue->lock);
          queue->dry_wait_ms += tts_now_ms() - started;
          if (queue->used == 0 && !queue->eof) queue->dry_events++;
          if (waited == ETIMEDOUT && queue->used > 0) break;
        }
      if (queue->abort || (queue->eof && queue->used == 0))
        {
          pthread_mutex_unlock(&queue->lock);
          break;
        }
      size_t take = queue->used;
      if (take > sizeof(chunk)) take = sizeof(chunk);
      size_t contiguous = queue->capacity - queue->head;
      if (take > contiguous) take = contiguous;
      memcpy(chunk, queue->ring + queue->head, take);
      queue->head = (queue->head + take) % queue->capacity;
      queue->used -= take;
      if (first)
        {
          queue->first_output_ms = tts_now_ms();
          first = false;
        }
      pthread_cond_signal(&queue->space);
      pthread_mutex_unlock(&queue->lock);

