Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_cloud.c
      queue->callback(chunk, take, 0, queue->context);
      delivered = true;
      if (atomic_load(&g_tts.canceled))
        {
          tts_queue_cancel(queue);
          break;
        }
    }

done:
  if (delivered && !queue->abort && queue->eof)
    queue->callback(NULL, 0, 1, queue->context);
  return NULL;
}

#define TTS_SOURCE_RATE 24000u
#define TTS_OUTPUT_RATE 16000u
#define TTS_RESAMPLE_BUFFER_SIZE 512u

/* A finished answer used to be one synthesis request, so the first audible
 * frame waited for the provider's first audio token of the whole text.  Send
 * the first sentence first and keep the remaining sentences flowing into the
 * same bounded audio queue, which preserves order and continuity without a
 * second player or a longer start-up buffer.  Request count stays bounded and
 * short answers keep exactly one request.
 */
#define BKCLOUD_TTS_PART_MAX        4u
#define BKCLOUD_TTS_PART_MIN_CHARS  16u
#define BKCLOUD_TTS_SPLIT_MIN_CHARS 80u

static bool tts_part_terminator(const char *text, size_t length, size_t index,
                                size_t *width)
{
  unsigned char c = (unsigned char)text[index];
  *width = 1;
  if (c == '\n') return true;
  if (c == '.' || c == '!' || c == '?' || c == ';')
    {
      /* Keep decimals and abbreviations inside one part. */
      if (c == '.' && index + 1 < length &&
          text[index + 1] >= '0' && text[index + 1] <= '9') return false;
      return index + 1 >= length || text[index + 1] == ' ' ||
             (unsigned char)text[index + 1] >= 0x80;
    }
  /* UTF-8 CJK sentence punctuation. */
  if (c == 0xe3 && index + 2 < length &&
      (unsigned char)text[index + 1] == 0x80 &&
      (unsigned char)text[index + 2] == 0x82)
    { *width = 3; return true; }                       /* 。 */
  if (c == 0xef && index + 2 < length &&
      (unsigned char)text[index + 1] == 0xbc &&
      ((unsigned char)text[index + 2] == 0x81 ||
       (unsigned char)text[index + 2] == 0x9f ||
       (unsigned char)text[index + 2] == 0x9b))
    { *width = 3; return true; }                       /* ！ ？ ； */
  return false;
}

/* Fills the end offsets of a bounded number of contiguous parts.  Returns the
 * part count, or 0 when the text must stay one request.  Characters are never
 * dropped, duplicated or reordered; the last part always ends at length.
 */
static size_t tts_parts(const char *text, size_t length, size_t *ends)
{
  size_t count = 0;
  size_t start = 0;
  if (length < BKCLOUD_TTS_SPLIT_MIN_CHARS) return 0;
  for (size_t i = 0; i < length; i++)
    {
      size_t width;
      if (count + 1 >= BKCLOUD_TTS_PART_MAX) break;
      if (!tts_part_terminator(text, length, i, &width)) continue;
      if (i + width - start < BKCLOUD_TTS_PART_MIN_CHARS) continue;
      ends[count++] = i + width;
      start = i + width;
      i += width - 1;
    }
  if (count == 0 || ends[count - 1] >= length) return count;
  ends[count++] = length;
  return count;
}

static int pcm_write(struct pcm_output_s *output, const void *data, size_t size)
{
  if (atomic_load(&g_tts.canceled)) return -ECANCELED;
  if (!size) return 0;
  if (output->queue)
    {
      /* The bounded queue decouples the provider's receive path from the
       * official playback callback.
       */
      int ret = tts_queue_write(output->queue, data, size);
      if (ret != 0) return ret;
    }
  else if (output->callback)
    {
      /* The official callback creates, prepares and feeds its Media player. */
      output->callback(data, size, 0, output->context);
      if (atomic_load(&g_tts.canceled)) return -ECANCELED;
    }
  else
    {
      if (size > output->capacity - output->used) return -ENOSPC;
      memcpy(output->buffer + output->used, data, size);
    }
  output->used += size;
  return atomic_load(&g_tts.canceled) ? -ECANCELED : 0;
}

static int16_t pcm_read_s16le(const unsigned char *data)
{
  return (int16_t)((uint16_t)data[0] | ((uint16_t)data[1] << 8));
}

static void pcm_write_s16le(unsigned char *data, int16_t sample)
{
  uint16_t value = (uint16_t)sample;
  data[0] = value & 0xff;
  data[1] = value >> 8;
}

/* MiMo emits fixed 24 kHz mono PCM while the validated BK7258 speaker ABI is
 * fixed at 16 kHz.  Normalize at the service-adapter boundary so the official
 * Agent and Media path receive the format advertised by this backend.  The
 * exact 3:2 linear conversion keeps state across arbitrary HTTP/SSE chunks. */
static int pcm_frames(struct pcm_output_s *output, const void *data, size_t size)
{
  const unsigned char *input = data;
  unsigned char converted[TTS_RESAMPLE_BUFFER_SIZE];
  size_t converted_size = 0;
  int ret;

  if (atomic_load(&g_tts.canceled)) return -ECANCELED;
  if (size & 1u) return -EPROTO;
  while (size)
    {
      output->pending[output->pending_count++] = pcm_read_s16le(input);
      input += sizeof(int16_t);
      size -= sizeof(int16_t);
      if (output->pending_count != 3) continue;

      pcm_write_s16le(converted + converted_size, output->pending[0]);
      converted_size += sizeof(int16_t);
      pcm_write_s16le(converted + converted_size,
                      (int16_t)(((int32_t)output->pending[1] +
                                 (int32_t)output->pending[2]) / 2));
      converted_size += sizeof(int16_t);
      output->pending_count = 0;

      if (converted_size == sizeof(converted))
        {
          ret = pcm_write(output, converted, converted_size);
          if (ret != 0) return ret;
          converted_size = 0;
        }
    }

  return pcm_write(output, converted, converted_size);
}

static int pcm_finish(struct pcm_output_s *output)
{
  unsigned char converted[2 * sizeof(int16_t)];
  size_t converted_size = 0;

  if (output->pending_count)
    {
      pcm_write_s16le(converted, output->pending[0]);
      converted_size = sizeof(int16_t);
      if (output->pending_count == 2)
        {
          pcm_write_s16le(converted + converted_size, output->pending[1]);
          converted_size += sizeof(int16_t);
        }
      output->pending_count = 0;
    }

  return pcm_write(output, converted, converted_size);
}

static int pcm_output(void *context, const void *data, size_t size)
{
  struct pcm_output_s *output = context;
  const unsigned char *bytes = data;
  int ret;
  if (!bytes && size) return -EPROTO;
  /* HTTP chunks are bytes, not guaranteed sample boundaries. */
  if (output->has_tail && size)
    {
      unsigned char sample[2] = { output->tail, *bytes++ };
      output->has_tail = false;
      size--;
      ret = pcm_frames(output, sample, sizeof(sample));
      if (ret != 0) return ret;
    }
  size_t aligned = size & ~(size_t)1;
  ret = pcm_frames(output, bytes, aligned);
  if (ret == 0 && size != aligned)
    {
      output->tail = bytes[aligned];
      output->has_tail = true;
    }
  return ret;
}

static int synthesize(struct pcm_output_s *output, const char *text)
{
  struct bkcloud_client_s *client = calloc(1, sizeof(*client));
  struct bkcloud_tts_s *decoder = calloc(1, sizeof(*decoder));
  int ret = -ENOMEM;
  if (client && decoder)
    ret = bkcloud_synthesize(client, decoder, &g_tts.service,
      &g_transport, &g_tts, bkvoice_config_now_ms(NULL) + 120000u,
      text, pcm_output, output);
  if (atomic_load(&g_tts.canceled)) ret = -ECANCELED;
  if (ret == 0) ret = pcm_finish(output);
  if (ret == 0 && (output->used == 0 || output->has_tail)) ret = -EPROTO;
  if (ret == 0 && output->callback && output->queue == NULL)
    output->callback(NULL, 0, 1, output->context);
  if (decoder) bkcloud_tts_clear(decoder);
  if (client) mbedtls_platform_zeroize(client, sizeof(*client));
  free(decoder);
  free(client);
  syslog(LOG_INFO, "AGENT TTS backend=%s mode=%s source_rate=%u "
    "output_rate=%u ret=%d bytes=%zu turn=%u\n",
    g_tts.settings->service.dialect == 2 ? "mimo" : "openai-audio",
    output->callback ? "audio-stream/full-text" : "batch",
    TTS_SOURCE_RATE, TTS_OUTPUT_RATE, ret, output->used,
    atomic_load(&g_turn_sequence));
  return ret;
}

/* Sends one accepted part per request into the same audio queue.  Order is
 * the answer's order, the queue stays continuous, and a failing part stops
 * the remaining parts instead of being hidden.
 */
static int synthesize_parts(struct pcm_output_s *output, const char *text,
                            size_t count, const size_t *ends)
{
  struct bkcloud_client_s *client = calloc(1, sizeof(*client));
  struct bkcloud_tts_s *decoder = calloc(1, sizeof(*decoder));
  char *part = NULL;
  size_t begin = 0;
  size_t capacity = 0;
  int ret = -ENOMEM;

