Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_cloud.c
  if (client == NULL || decoder == NULL) goto out;
  ret = 0;
  for (size_t index = 0; index < count; index++)
    {
      size_t size = ends[index] - begin;
      if (size + 1 > capacity)
        {
          char *grown = realloc(part, size + 1);
          if (grown == NULL) { ret = -ENOMEM; break; }
          part = grown;
          capacity = size + 1;
        }
      memcpy(part, text + begin, size);
      part[size] = 0;
      ret = bkcloud_synthesize(client, decoder, &g_tts.service, &g_transport,
        &g_tts, bkvoice_config_now_ms(NULL) + 120000u, part, pcm_output, output);
      if (atomic_load(&g_tts.canceled)) ret = -ECANCELED;
      if (ret != 0)
        {
          syslog(LOG_WARNING, "AGENT TTS part %lu/%lu failed ret=%d\n",
                 (unsigned long)index + 1, (unsigned long)count, ret);
          break;
        }
      begin = ends[index];
    }
  if (ret == 0) ret = pcm_finish(output);
  if (ret == 0 && (output->used == 0 || output->has_tail)) ret = -EPROTO;

out:
  if (part != NULL)
    {
      mbedtls_platform_zeroize(part, capacity);
      free(part);
    }
  if (decoder) bkcloud_tts_clear(decoder);
  if (client) mbedtls_platform_zeroize(client, sizeof(*client));
  free(decoder);
  free(client);
  syslog(LOG_INFO, "AGENT TTS parts count=%lu ret=%d bytes=%zu turn=%u\n",
         (unsigned long)count, ret, output->used,
         atomic_load(&g_turn_sequence));
  return ret;
}

static int synthesize_stream(const char *text, voice_tts_chunk_cb callback,
                             void *context)
{
  struct pcm_output_s output = { .callback = callback, .context = context };
  struct tts_queue_s *queue = tts_queue_create();
  uint64_t started_ms = tts_now_ms();
  size_t ends[BKCLOUD_TTS_PART_MAX];
  size_t parts;
  int ret;

  /* Keep the previous direct path when the bounded queue cannot be created:
   * a missing diagnostic buffer must not disable voice playback. */
  if (queue == NULL) return synthesize(&output, text);

  queue->callback = callback;
  queue->context = context;
  if (pthread_create(&queue->worker, NULL, tts_queue_worker, queue) != 0)
    {
      tts_queue_destroy(queue);
      return synthesize(&output, text);
    }

  queue->running = true;
  output.queue = queue;
  parts = tts_parts(text, strlen(text), ends);
  ret = parts > 1 ? synthesize_parts(&output, text, parts, ends) :
                    synthesize(&output, text);

  /* Mark the end only after the last frame has been handed over, so the
   * consumer never treats a temporary shortage as the end of the stream. */
  tts_queue_mark_eof(queue, ret == 0);
  pthread_join(queue->worker, NULL);
  queue->running = false;

  if (ret == 0 && (queue->abort || atomic_load(&g_tts.canceled)))
    ret = -ECANCELED;

  /* One bounded line per synthesis request so the receive, queue and playback
   * split can be compared without full logs.  Values are monotonic
   * milliseconds relative to this request; "first_pcm_ms" is the first PCM
   * frame accepted from the provider, "first_frame_ms" is the first frame
   * handed to the official playback callback.  Neither is proof of audible
   * sound.
   */
  syslog(LOG_INFO, "AGENT TTS queue ret=%d bytes=%zu total_ms=%llu "
    "first_pcm_ms=%llu first_frame_ms=%llu max_gap_ms=%llu gaps=%lu "
    "peak=%lu producer_wait_ms=%llu dry_events=%lu dry_wait_ms=%llu turn=%u\n",
    ret, output.used, (unsigned long long)(tts_now_ms() - started_ms),
    (unsigned long long)(queue->first_input_ms ?
      queue->first_input_ms - started_ms : 0),
    (unsigned long long)(queue->first_output_ms ?
      queue->first_output_ms - started_ms : 0),
    (unsigned long long)queue->max_gap_ms,
    (unsigned long)queue->gap_events, (unsigned long)queue->peak,
    (unsigned long long)queue->producer_wait_ms,
    (unsigned long)queue->dry_events,
    (unsigned long long)queue->dry_wait_ms,
    atomic_load(&g_turn_sequence));
  output.queue = NULL;
  tts_queue_destroy(queue);
  return ret;
}

static int synthesize_batch(const char *text, unsigned char *pcm,
                            size_t capacity, size_t *used)
{
  struct pcm_output_s output = { .buffer = pcm, .capacity = capacity };
  int ret = synthesize(&output, text);
  *used = ret == 0 ? output.used : 0;
  if (ret != 0) mbedtls_platform_zeroize(pcm, output.used);
  return ret;
}

static int capabilities(voice_tts_capabilities_t *caps)
{
  *caps = (voice_tts_capabilities_t)
    {
      .location = VOICE_TTS_LOCATION_REMOTE,
      .needs_network = true,
      .sample_rate = TTS_OUTPUT_RATE,
      .batch_sample_rate = TTS_OUTPUT_RATE,
      .channels = 1,
      .bits = 16,
    };
  return 0;
}

#define ASR_OPS(label, prepare) \
  { .name = label, .init = prepare, .prepare_request = asr_request_prepare, \
    .recognize = recognize, .cancel = asr_cancel, .deinit = asr_release }
#define TTS_OPS(label, prepare) \
  { .name = label, .init = prepare, .prepare_request = tts_request_prepare, \
    .synthesize = synthesize_batch, .synthesize_stream = synthesize_stream, \
    .get_capabilities = capabilities, \
    .cancel = tts_cancel, .deinit = tts_release }

static const voice_asr_ops_t g_asr_mimo = ASR_OPS("mimo", asr_mimo_prepare);
static const voice_asr_ops_t g_asr_audio = ASR_OPS("openai-audio", asr_audio_prepare);
static const voice_tts_ops_t g_tts_mimo = TTS_OPS("mimo", tts_mimo_prepare);
static const voice_tts_ops_t g_tts_audio = TTS_OPS("openai-audio", tts_audio_prepare);

int bkagent_cloud_register(void)
{
  int results[] = { voice_asr_register(&g_asr_mimo),
                    voice_asr_register(&g_asr_audio),
                    voice_tts_register(&g_tts_mimo),
                    voice_tts_register(&g_tts_audio) };
  for (unsigned int i = 0; i < sizeof(results) / sizeof(results[0]); i++)
    if (results[i] != 0 && results[i] != -ENOKEY) return results[i];
  return 0;
}

int bkagent_cloud_models_get(struct bkcloud_models_s *models)
{
  if (!models) return -EINVAL;
  memset(models, 0, sizeof(*models));
  pthread_mutex_lock(&g_config_lock);
  if (g_selected)
    {
      memcpy(models->asr_model, g_selected->service.asr_model,
             sizeof(models->asr_model));
      memcpy(models->chat_model, g_selected->service.chat_model,
             sizeof(models->chat_model));
      memcpy(models->tts_model, g_selected->service.tts_model,
             sizeof(models->tts_model));
    }
  int ret = g_selected ? 0 : -ENOKEY;
  pthread_mutex_unlock(&g_config_lock);
  return ret;
}

static int configure(const void *trust, size_t trust_size,
                     const void *cloud, size_t cloud_size,
                     const struct bkcloud_models_s *candidate)
{
  if (voice_asr_is_busy() || voice_tts_is_busy() || llm_request_busy()) return -EBUSY;
  struct cloud_settings_s *next = calloc(1, sizeof(*next));
  if (!next) return -ENOMEM;
  mbedtls_ssl_session_init(&next->session);
  next->references = 1;
  int ret = bkcloud_config_decode(&next->service, cloud, cloud_size);
  if (!ret)
    {
      struct bkcloud_models_s models = { 0 };
      int selected = 0;
      if (candidate)
        {
          models = *candidate;
        }
      else
        {
          selected = bk7258_preferences_cloud_models_get(&models);
        }
      if (!selected)
        {
          memcpy(next->service.asr_model, models.asr_model, sizeof(models.asr_model));
          memcpy(next->service.chat_model, models.chat_model, sizeof(models.chat_model));
          memcpy(next->service.tts_model, models.tts_model, sizeof(models.tts_model));
        }
      else if (selected != -ENOENT) ret = selected;
      mbedtls_platform_zeroize(&models, sizeof(models));
    }
  if (ret == 0) ret = bkvoice_config_load(&next->trust, trust, trust_size);
  if (ret == 0 && (strcmp(next->trust.host, next->service.host) ||
                   next->trust.port != next->service.port)) ret = -EINVAL;
  if (ret != 0) { settings_release(next); return ret; }
  pthread_mutex_lock(&g_config_lock);
  struct cloud_settings_s *previous = g_selected;
  g_selected = next;
  pthread_mutex_unlock(&g_config_lock);
  settings_release(previous);
  /* Selection is a separate official registry operation. Installing cloud
   * settings must never select cloud TTS over an explicitly local backend. */
  return 0;
}

int bkagent_cloud_configure(const void *trust, size_t trust_size,
                           const void *cloud, size_t cloud_size)
{
  return configure(trust, trust_size, cloud, cloud_size, NULL);
}

int bkagent_cloud_configure_models(const void *trust, size_t trust_size,
                                  const void *cloud, size_t cloud_size,
                                  const struct bkcloud_models_s *models)
{
  if (!models) return -EINVAL;
  return configure(trust, trust_size, cloud, cloud_size, models);
}
